; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-5-12)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	city11 - city
	city12 - city
	city13 - city
	city14 - city
	city15 - city
	city16 - city
	city17 - city
	city18 - city
	city19 - city
	city20 - city
	city21 - city
	city22 - city
	city23 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city6)
	(fuel-level plane1 fl0)
	(at plane2 city18)
	(fuel-level plane2 fl5)
	(at plane3 city19)
	(fuel-level plane3 fl5)
	(at plane4 city23)
	(fuel-level plane4 fl0)
	(at plane5 city12)
	(fuel-level plane5 fl6)
	(at person1 city13)
	(at person2 city7)
	(at person3 city19)
	(at person4 city19)
	(at person5 city10)
	(at person6 city1)
	(at person7 city10)
	(at person8 city13)
	(at person9 city2)
	(at person10 city17)
	(at person11 city1)
	(at person12 city8)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at person1 city13)
	(at person2 city17)
	(at person3 city4)
	(at person4 city5)
	(at person5 city19)
	(at person6 city4)
	(at person7 city8)
	(at person8 city13)
	(at person9 city21)
	(at person10 city14)
	(at person11 city4)
	(at person12 city11)
	))

)

; plan
1. (board person4 plane3 city19)
   deleted: (at person4 city19)
   added: (in person4 plane3)
   goals met: 2 of 12
2. (board person3 plane3 city19)
   deleted: (at person3 city19)
   added: (in person3 plane3)
   goals met: 2 of 12
3. (zoom plane3 city19 city4 fl5 fl4 fl3)
   deleted: (at plane3 city19) (fuel-level plane3 fl5)
   added: (at plane3 city4) (fuel-level plane3 fl3)
   goals met: 2 of 12
4. (debark person3 plane3 city4)
   deleted: (in person3 plane3)
   added: (at person3 city4)
   goals met: 3 of 12
5. (zoom plane3 city4 city5 fl3 fl2 fl1)
   deleted: (at plane3 city4) (fuel-level plane3 fl3)
   added: (at plane3 city5) (fuel-level plane3 fl1)
   goals met: 3 of 12
6. (debark person4 plane3 city5)
   deleted: (in person4 plane3)
   added: (at person4 city5)
   goals met: 4 of 12
7. (zoom plane2 city18 city1 fl5 fl4 fl3)
   deleted: (at plane2 city18) (fuel-level plane2 fl5)
   added: (at plane2 city1) (fuel-level plane2 fl3)
   goals met: 4 of 12
8. (board person6 plane2 city1)
   deleted: (at person6 city1)
   added: (in person6 plane2)
   goals met: 4 of 12
9. (zoom plane2 city1 city10 fl3 fl2 fl1)
   deleted: (at plane2 city1) (fuel-level plane2 fl3)
   added: (at plane2 city10) (fuel-level plane2 fl1)
   goals met: 4 of 12
10. (board person7 plane2 city10)
   deleted: (at person7 city10)
   added: (in person7 plane2)
   goals met: 4 of 12
11. (board person5 plane2 city10)
   deleted: (at person5 city10)
   added: (in person5 plane2)
   goals met: 4 of 12
12. (fly plane2 city10 city19 fl1 fl0)
   deleted: (at plane2 city10) (fuel-level plane2 fl1)
   added: (at plane2 city19) (fuel-level plane2 fl0)
   goals met: 4 of 12
13. (refuel plane2 city19 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 4 of 12
14. (debark person5 plane2 city19)
   deleted: (in person5 plane2)
   added: (at person5 city19)
   goals met: 5 of 12
15. (fly plane2 city19 city4 fl1 fl0)
   deleted: (at plane2 city19) (fuel-level plane2 fl1)
   added: (at plane2 city4) (fuel-level plane2 fl0)
   goals met: 5 of 12
16. (refuel plane2 city4 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 5 of 12
17. (debark person6 plane2 city4)
   deleted: (in person6 plane2)
   added: (at person6 city4)
   goals met: 6 of 12
18. (fly plane2 city4 city8 fl1 fl0)
   deleted: (at plane2 city4) (fuel-level plane2 fl1)
   added: (at plane2 city8) (fuel-level plane2 fl0)
   goals met: 6 of 12
19. (debark person7 plane2 city8)
   deleted: (in person7 plane2)
   added: (at person7 city8)
   goals met: 7 of 12
20. (board person12 plane2 city8)
   deleted: (at person12 city8)
   added: (in person12 plane2)
   goals met: 7 of 12
21. (refuel plane2 city8 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 7 of 12
22. (fly plane2 city8 city11 fl1 fl0)
   deleted: (at plane2 city8) (fuel-level plane2 fl1)
   added: (at plane2 city11) (fuel-level plane2 fl0)
   goals met: 7 of 12
23. (debark person12 plane2 city11)
   deleted: (in person12 plane2)
   added: (at person12 city11)
   goals met: 8 of 12
24. (fly plane3 city5 city1 fl1 fl0)
   deleted: (at plane3 city5) (fuel-level plane3 fl1)
   added: (at plane3 city1) (fuel-level plane3 fl0)
   goals met: 8 of 12
25. (zoom plane5 city12 city17 fl6 fl5 fl4)
   deleted: (at plane5 city12) (fuel-level plane5 fl6)
   added: (at plane5 city17) (fuel-level plane5 fl4)
   goals met: 8 of 12
26. (board person10 plane5 city17)
   deleted: (at person10 city17)
   added: (in person10 plane5)
   goals met: 8 of 12
27. (zoom plane5 city17 city14 fl4 fl3 fl2)
   deleted: (at plane5 city17) (fuel-level plane5 fl4)
   added: (at plane5 city14) (fuel-level plane5 fl2)
   goals met: 8 of 12
28. (debark person10 plane5 city14)
   deleted: (in person10 plane5)
   added: (at person10 city14)
   goals met: 9 of 12
29. (board person11 plane3 city1)
   deleted: (at person11 city1)
   added: (in person11 plane3)
   goals met: 9 of 12
30. (refuel plane3 city1 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 9 of 12
31. (zoom plane5 city14 city2 fl2 fl1 fl0)
   deleted: (at plane5 city14) (fuel-level plane5 fl2)
   added: (at plane5 city2) (fuel-level plane5 fl0)
   goals met: 9 of 12
32. (board person9 plane5 city2)
   deleted: (at person9 city2)
   added: (in person9 plane5)
   goals met: 9 of 12
33. (refuel plane5 city2 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 9 of 12
34. (fly plane5 city2 city21 fl1 fl0)
   deleted: (at plane5 city2) (fuel-level plane5 fl1)
   added: (at plane5 city21) (fuel-level plane5 fl0)
   goals met: 9 of 12
35. (debark person9 plane5 city21)
   deleted: (in person9 plane5)
   added: (at person9 city21)
   goals met: 10 of 12
36. (fly plane3 city1 city4 fl1 fl0)
   deleted: (at plane3 city1) (fuel-level plane3 fl1)
   added: (at plane3 city4) (fuel-level plane3 fl0)
   goals met: 10 of 12
37. (refuel plane3 city4 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 10 of 12
38. (debark person11 plane3 city4)
   deleted: (in person11 plane3)
   added: (at person11 city4)
   goals met: 11 of 12
39. (fly plane3 city4 city7 fl1 fl0)
   deleted: (at plane3 city4) (fuel-level plane3 fl1)
   added: (at plane3 city7) (fuel-level plane3 fl0)
   goals met: 11 of 12
40. (board person2 plane3 city7)
   deleted: (at person2 city7)
   added: (in person2 plane3)
   goals met: 11 of 12
41. (refuel plane3 city7 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 11 of 12
42. (fly plane3 city7 city17 fl1 fl0)
   deleted: (at plane3 city7) (fuel-level plane3 fl1)
   added: (at plane3 city17) (fuel-level plane3 fl0)
   goals met: 11 of 12
43. (debark person2 plane3 city17)
   deleted: (in person2 plane3)
   added: (at person2 city17)
   goals met: 12 of 12
